app/views/favorites/_favorite-btn.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."product_id" = ?  [["product_id", 1]]
---
      <%= link_to product_favorites_path(product), method: :delete ,remote: true do %>
        ♥いいね(<%= product.favorites.count %>)

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."product_id" = ?  [["product_id", 1]]
---
      <%= link_to product_favorites_path(product), method: :post ,remote: true do %>
        ♡いいね(<%= product.favorites.count %>)