app/controllers/favorites_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["product_id", 1], ["created_at", "2021-07-22 02:06:02.950309"], ["updated_at", "2021-07-22 02:06:02.950309"]]
---
  def create
   @post_image = Product.find(params[:product_id])
   favorite = current_user.favorites.new(product_id: @post_image.id)
   favorite.save