app/controllers/products_controller.rb

  def index
     @product_images = Product.all
     @product_images = Product.page(params[:page]).per(6).reverse_order
---
SELECT  "products".* FROM "products" ORDER BY "products"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 0]]