app/controllers/products_controller.rb

  def create
    @product = Product.new(product_image_params)
    @product.user_id = current_user.id
    if @product.save
---
INSERT INTO "products" ("user_id", "genre_id", "product_image_id", "shop_name", "description", "menu_name", "address", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @product = Product.find(params[:id])
    if @product.update(product_image_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "product_image_id" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["product_image_id", "7e4844cca46bc7c220a12a0177b6c68a240d3d3135776c7d7fc99145c1dd"], ["updated_at", "2021-07-22 02:06:05.925711"], ["id", 1]]