app/views/products/edit.html.erb

SELECT "genres".* FROM "genres"
---
  <h4>ジャンル</h4>
  <%= f.collection_select(:genre_id, Genre.all, :id, :genre_name, prompt: "-- 選択してください --") %>