app/views/products/index.html.erb

  <tr>
    <td colspan="2">♥いいね(<%= product_image.favorites.count%>)</td>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."product_id" = ?  [["product_id", 1]]

  <tr>
    <td colspan="2"><%= link_to " コメント(#{product_image.comments.count})",product_path(product_image.id) %></td>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]