app/views/products/new.html.erb

SELECT "genres".* FROM "genres"
---
    <h6>ジャンル</h6>
      <%= f.collection_select(:genre_id, Genre.all, :id, :genre_name, prompt: "-- 選択してください --") %>