app/views/products/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]
---
<div class="comments">
<p>コメント件数：<%= @product.comments.count %></p>