app/views/layouts/application.html.erb

       <%= form_with url: search_products_path, method: :get, local: true,class: "d-flex" do |f| %>
        <%= f.collection_select(:genre_id, Genre.all, :id, :genre_name, prompt: "-- 選択してください --") %>
---
SELECT "genres".* FROM "genres"